app/models/concerns/current_cart.rb

  def set_cart
    @cart = Cart.find(session[:cart_id])
  rescue ActiveRecord::RecordNotFound
    @cart = Cart.create
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-12-03 21:20:41.316308"], ["updated_at", "2020-12-03 21:20:41.316308"]]