app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY created_at desc
---
  def index
    @products = Product.all.order("created_at desc")

INSERT INTO "products" ("brand", "material", "description", "condition", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "\"adidas.png\""], ["updated_at", "2020-12-01 22:11:39.651535"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)